2024-02-01-TopLevelFolders/how-i-sync-and-backup-files.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://dou-meishi.github.io/org-blog/rss.xml"
      title="RSS feed for https://dou-meishi.github.io/org-blog/">
<title>How I create backups</title>
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="google-site-verification" content="_Ly4i8BW_CWeGaFdsQgJ2xN-yOkGpSDnLw8LitvkEsw" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="https://dou-meishi.github.io/orgcss/dou-new-org.css"/>
<!-- Additional CSS for my blog site -->
<link rel="stylesheet" type="text/css" href="https://dou-meishi.github.io/org-blog/static/blog.css"/>
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
</div>
<div id="content">
<div class="post-date">03 Feb 2024</div><h1 class="post-title"><a href="https://dou-meishi.github.io/org-blog/2024-02-01-TopLevelFolders/how-i-sync-and-backup-files.html">How I create backups</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcbd1d38">Different focus of syncing and backing up</a></li>
<li><a href="#orgf94fdc3">Presync</a></li>
<li><a href="#org7f8ab47">Backup</a></li>
</ul>
</div>
</nav>
<p>
In <a href="https://dou-meishi.github.io/org-blog/2023-09-16-UltimateFileManagement/events-oriented-file-storage-framework">the previous post</a>, I discussed the how I organize the folder
<code>~/Documents/</code>. In my home directory <code>~/</code>, there are another two folders
with special purposes: <code>~/Assets/</code> and <code>~/AAA/</code>.
</p>

<p>
Generally speaking, <code>AAA/</code> severs as a trash bin; <code>Assets/</code> severs as a
repo for large files; <code>Documents/</code> severs as the main workspace,
containing all event folders; see <a href="https://dou-meishi.github.io/org-blog/2023-09-16-UltimateFileManagement/events-oriented-file-storage-framework">this post</a> for what is an event
folder.  During backups, <code>AAA/</code> is ignored, and only <code>Assets/</code> and
<code>Documents/</code> are considered.
</p>

<p>
In general, if any folder or file outside these three folders is of
interest, they should have a local backup in <code>Assets/</code> or <code>Documents/</code>,
maintaining by a special script <code>dms-presync</code>. This script should be
executed before the actual backup process begins.
</p>
<div id="outline-container-orgcbd1d38" class="outline-2">
<h2 id="orgcbd1d38"><a href="#orgcbd1d38">Different focus of syncing and backing up</a></h2>
<div class="outline-text-2" id="text-orgcbd1d38">
<p>
First, I would like to give some difference between syncing and
backing up based on personal experiences.
</p>

<p>
In synchronization, it is generally advised to treat folder as the
smallest unit and avoid excluding some files or subfolders within the
folder. Doing so ensures a seamless experience in switching machines
to work on the same folder. When a folder is integrated into the
synchronization framework, one should expect to have an identical
experience across different machines.
</p>

<p>
On the other hand, backup procedures differ. In the context of backup,
the primary goal is to prevent any data loss, rather than emphasizing
a seamless experience when switching between machines. Consequently,
certain unnecessary files could and should be ignored.
</p>
</div>
</div>
<div id="outline-container-orgf94fdc3" class="outline-2">
<h2 id="orgf94fdc3"><a href="#orgf94fdc3">Presync</a></h2>
<div class="outline-text-2" id="text-orgf94fdc3">
<p>
The purpose of this stage is to ensure that it is sufficient to
consider only the two folders <code>Assets/</code> and <code>Documents/</code> in creating
backups.
</p>

<ol class="org-ol">
<li>Normalize event folders in <code>Documents/</code>.</li>

<li><p>
Ensure all files of interest have an up-to-date version in <code>Assets/</code> or <code>Documents/</code>.
</p>

<p>
Some folders involved in this stage include, e.g., <code>~/.local/share/fonts/</code>,
<code>~/org/</code> and <code>~/.themes/</code>.
</p></li>
</ol>
</div>
</div>
<div id="outline-container-org7f8ab47" class="outline-2">
<h2 id="org7f8ab47"><a href="#org7f8ab47">Backup</a></h2>
<div class="outline-text-2" id="text-org7f8ab47">
<p>
The actual backup process can be generally split into two steps:
backup <code>.git/</code> folders and backup other folders.
</p>

<p>
For each git repos, I manually back them up to the special upstream
<code>backup</code>, which could be a remote repo in some cloud server or a local
repo in the backup drive.<sup>[<a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a>]</sup>
</p>

<p>
Suppose then I want to backup all necessary files in <code>/home/dou</code> to
<code>/media/dou/BACKUP/dou/</code>, I go through the following steps (in this
stage, all <code>.git/</code> folders are ignored).
</p>

<ol class="org-ol">
<li value="0">Ensure <code>/media/dou/BACKUP/dou/</code> is a git repo.</li>

<li>Run <code>unison backup</code> to bakcup <code>~/Assets/</code> and <code>~/Documents/</code>.</li>

<li>Commit in <code>/media/dou/BACKUP/dou/</code>.</li>
</ol>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup>[<a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a>]</sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The command <code>find . -name ".git"</code> can list all git repos.
</p></div></div>


</div>
</div><div class="taglist"><a href="https://dou-meishi.github.io/org-blog/tags.html">Tags</a>: <a href="https://dou-meishi.github.io/org-blog/tag-think.html">think</a> </div>
<div id="comments"><script src="https://giscus.app/client.js"
        data-repo="Dou-Meishi/org-blog"
        data-repo-id="R_kgDOLJfSOw"
        data-category="Announcements"
        data-category-id="DIC_kwDOLJfSO84CkxDd"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="bottom"
        data-theme="light"
        data-lang="en"
        crossorigin="anonymous"
        async>
</script>
</div></div>
<div id="postamble" class="status">Created by <a href="https://github.com/bastibe/org-static-blog/">Org Static Blog</a>
</div>
</body>
</html>
